
Функция ПолучитьКоличествоДнейДоНачисления(Дата) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДнейДоНачисленияСрезПоследних.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.ДнейДоНачисления.СрезПоследних(&Дата, ) КАК ДнейДоНачисленияСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Количество;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции