
&НаСервере
Процедура ЗаполнитьПокупкамиНаСервере()
	
	Объект.Покупки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Объект.ДатаОстатков);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежиОстатки.Контрагент КАК Контрагент,
		|	ПлатежиОстатки.Основание КАК Основание,
		|	ПлатежиОстатки.СуммаОстаток КАК Сумма
		|ПОМЕСТИТЬ втСуммы
		|ИЗ
		|	РегистрНакопления.Платежи.Остатки(&Дата) КАК ПлатежиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втСуммы.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ втКонтрагенты
		|ИЗ
		|	втСуммы КАК втСуммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКонтрагенты.Контрагент КАК Контрагент,
		|	Контрагенты.Процент КАК Процент
		|ПОМЕСТИТЬ втПроценты
		|ИЗ
		|	втКонтрагенты КАК втКонтрагенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО втКонтрагенты.Контрагент = Контрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСуммы.Контрагент КАК Контрагент,
		|	втСуммы.Основание КАК Основание,
		|	втСуммы.Сумма КАК Сумма,
		|	втПроценты.Процент КАК Процент,
		|	ВЫРАЗИТЬ(втСуммы.Сумма * втПроценты.Процент / 100 КАК ЧИСЛО(12, 2)) КАК Бонусы
		|ИЗ
		|	втСуммы КАК втСуммы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПроценты КАК втПроценты
		|		ПО втСуммы.Контрагент = втПроценты.Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Покупки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПокупками(Команда)
	ЗаполнитьПокупкамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьПериод()
	КоличествоДнейДоНачисления = НастройкиСерверПовтИсп.ПолучитьКоличествоДнейДоНачисления(Объект.Дата);
	Объект.ДатаОстатков = НачалоДня(Объект.Дата) - КоличествоДнейДоНачисления * 86400;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПериод();
КонецПроцедуры
