
Функция ПроверкаСвязиGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200, "Bonus balance verification service is available");
	Возврат Ответ;
КонецФункции

Функция ПолучитьБалансКонтрагентаGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(500);
	КонтрагентПредставление = "Не найден";
	Бонусы = 0; 
	
	Версия = Запрос.ПараметрыURL.Получить("Версия");
	ГУИД = Запрос.ПараметрыURL.Получить("ГУИД");
	Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	КонтрагентСтрокой = XMLСтрока(Контрагент.УникальныйИдентификатор());
	
	Если ТипЗнч(Версия) = Тип("Строка") И Версия = "v1" Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БонусыОстатки.Контрагент.Представление КАК КонтрагентПредставление,
		|	БонусыОстатки.БонусыОстаток КАК Бонусы
		|ИЗ
		|	РегистрНакопления.Бонусы.Остатки(, Контрагент = &Контрагент) КАК БонусыОстатки";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			КонтрагентПредставление = Выборка.КонтрагентПредставление;
			Бонусы = Выборка.Бонусы;
			Ответ.КодСостояния = 200;
		КонецЕсли;
	КонецЕсли;
	
	ШаблонОтвета = "Для контрагента <%1> (ГУИД %2) баланс %3 бонусов";
	ТекстОтвета = СтрШаблон(ШаблонОтвета, КонтрагентПредставление, КонтрагентСтрокой, Бонусы);
	
	СтруктураДляОтвета = Новый Структура();
	СтруктураДляОтвета.Вставить("counterparty", КонтрагентПредставление);
	СтруктураДляОтвета.Вставить("counterparty_id", КонтрагентСтрокой);
	СтруктураДляОтвета.Вставить("bonus", Бонусы);
	СтруктураДляОтвета.Вставить("description", ТекстОтвета);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДляОтвета);
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Возврат Ответ;
	
КонецФункции
