
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Бонусы Расход
	Движения.Бонусы.Записывать = Истина;
	Движение = Движения.Бонусы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Основание = Основание;
	Движение.Бонусы = Бонусы;
	
	Движения.Бонусы.Записать();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БонусыОстатки.БонусыОстаток КАК Бонусы
		|ИЗ
		|	РегистрНакопления.Бонусы.Остатки(&Дата, Контрагент = &Контрагент) КАК БонусыОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() И Выборка.Бонусы < 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
