
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Платежи Расход
	Движения.Платежи.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Покупки Цикл
		Движение = Движения.Платежи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ДатаОстатков;
		Движение.Контрагент = ТекСтрокаПокупки.Контрагент;
		Движение.Основание = ТекСтрокаПокупки.Основание;
		Движение.Сумма = ТекСтрокаПокупки.Сумма;
	КонецЦикла;
	
	// регистр Бонусы Приход
	Движения.Бонусы.Записывать = Истина;
	Для Каждого ТекСтрокаПокупки Из Покупки Цикл
		Движение = Движения.Бонусы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаПокупки.Контрагент;
		Движение.Основание = ТекСтрокаПокупки.Основание;
		Движение.Бонусы = ТекСтрокаПокупки.Бонусы;
	КонецЦикла;
	
КонецПроцедуры
